#!/usr/bin/env python
# -*- coding:utf-8 -*-


district_maps = {           #定义字典
    "华东区":{"山东":["济南","青岛","淄博"],"江苏":["苏州","南京","无锡"],"浙江":["杭州","宁波","温州"],},
    "华南区":{"广东":["广州","深圳","珠海"],"广西":["桂林","柳州","北海"],"海南":["三亚","海口","三沙"]},
    "华中区":{"湖北":["武汉","宜昌","黄冈"],"湖南":["长沙","株洲","湘潭"],"江西":["南昌","九江","上饶"]},
    "华北区":{"北京":["东城区","朝阳区","海淀区"],"天津":["和平区","河西区","河北区"],"河北":["石家庄","唐山","张家口"]},
    "西北区":{"宁夏":["银川","吴忠","固原"],"青海":["西宁","海东","海北藏族自治州"],"陕西":["西安","咸阳","延安"]},
    "西南区":{"四川":["成都","绵阳","广元"],"云南":["昆明","丽江","玉溪"],"贵州":["贵阳","安顺","铜仁"]},
    "东北区":{"辽宁":["沈阳","大连","鞍山"],"吉林":["长春","吉林","辽源"],"黑龙江":["哈尔滨","齐齐哈尔","牡丹江"]},
    "港澳台区":{"香港":["香港岛","九龙半岛","新界"],"澳门":["澳门半岛","离岛","路氹城"],"台湾":["台北","台中","台南"]},
}

def menu():
   while True:
        on = ()
        c = ()
        for i in district_maps:
            print(i)
        on = input("请输入地区：")
        while True:
            if on in district_maps.keys():
                for e in district_maps[on]:
                    print(e)
                c = input("请输入省份：")
                if c in district_maps[on]:
                    for d in district_maps[on][c]:
                        print(d)
                    while True:
                        d = input("返回上层请输入b，退出请输入q：")
                        if d == "b":
                            break
                        elif d == "q":
                            print("谢谢使用")
                            exit(0)
                        else:
                            print("输入错误，请重新输入")
                elif c == "b":
                    break
                elif c == "q":
                    print("谢谢使用")
                    exit(0)
                else:
                    print("输入有误，请重新输入")
            elif on == "q":
                print("谢谢使用")
                exit(0)
            else:
                print("输入有误，请重新输入")
if __name__ == '__main__':
    menu()